[{"id":0,"enunciado":"¿Cómo se denomina al tipo de elemento XML que contiene más elementos, atributos, entidades, notaciones o texto normal?","respuestas":["Elemento hijo.","Elemento padre.","Elemento raíz."],"solucion":"Elemento raíz."},
{"id":1,"enunciado":"¿Qué es una DTD interna en XML?","respuestas":["Es una DTD que contiene las reglas de validación en una dirección URL, permitiendo el acceso desde cualquier lugar y dispositivo.","Es una DTD que contiene las reglas de validación en un archivo externo al documento XML, facilitando la reutilización y el mantenimiento.","Es una DTD que contiene las reglas de validación en el propio documento XML, simplificando el número de documentos y dejando uno único."],"solucion":"Es una DTD que contiene las reglas de validación en el propio documento XML, simplificando el número de documentos y dejando uno único."},
{"id":2,"enunciado":"¿Qué es un documento válido en XML?","respuestas":["Un documento que contiene la declaración del tipo de documento y la definición del tipo de documento (DTD).","Un documento que respeta la sintaxis de XML en sus documentos, cumpliendo las reglas generales de diseño.","Un documento que valida la estructura de XML según las reglas definidas en el DTD o XML Schema."],"solucion":"Un documento que valida la estructura de XML según las reglas definidas en el DTD o XML Schema."},
{"id":3,"enunciado":"¿Qué tipo de expresión es FLWOR en XQuery?","respuestas":["Una expresión que crea y modifica información de una o más fuentes","Una expresión que combina y reestructura información de una o más fuentes","Una expresión que filtra y ordena información de una o más fuentes"],"solucion":"Una expresión que combina y reestructura información de una o más fuentes"},
{"id":4,"enunciado":"¿Cuál es el tipo de elemento XSLT que permite ordenar los nodos seleccionados por un elemento for-each por el contenido de un campo?","respuestas":["xsl:sort","xsl:value-of","xsl:order"],"solucion":"xsl:sort"},
{"id":5,"enunciado":"¿Cómo se denomina al tipo de atributo XML que permite la identificación única de un elemento?","respuestas":["Enumerado.","ID.","CDATA."],"solucion":"ID."},
{"id":6,"enunciado":"Ventaja del uso de un tipado estático en XQuery.","respuestas":["Permite definir tipos de datos personalizados","Permite detectar errores antes de acceder a los datos","Permite optimizar el rendimiento de las consultas"],"solucion":"Permite detectar errores antes de acceder a los datos"},
{"id":7,"enunciado":"¿Cuál es el tipo de documento XML que se asocia con una hoja de estilo XSL mediante la etiqueta de declaración <?xml-stylesheet?>?","respuestas":["Documento resultado","Documento de transformación","Documento fuente"],"solucion":"Documento fuente"},
{"id":8,"enunciado":"La cláusula que se usa para construir el resultado de una consulta en XQuery es…","respuestas":["return","for","let"],"solucion":"return"},
{"id":9,"enunciado":"¿Qué significa XSL?","respuestas":["Extensible Scripting Language","Extensible Schema Language","Extensible Stylesheet Language"],"solucion":"Extensible Stylesheet Language"},
{"id":10,"enunciado":"¿Cuál es el tipo de atributo que se utiliza para definir las reglas de transformación para los nodos que coinciden con una expresión XPath?","respuestas":["apply","select","match"],"solucion":"match"},
{"id":11,"enunciado":"Ventaja de XSLT desde el lado servidor.","respuestas":["Permite crear documentos XML a partir de otros documentos XML","Permite crear páginas web dinámicas a partir de datos XML","Permite crear plantillas más simples y precisas para procesar datos XML a HTML"],"solucion":"Permite crear plantillas más simples y precisas para procesar datos XML a HTML"},
{"id":12,"enunciado":"El atributo version en XSLT es…","respuestas":["Es el atributo que permite definir la versión de XML que se utiliza para escribir el documento de transformación XSLT.","Es el atributo que permite definir la versión de XML que se utiliza para escribir el documento resultante de la transformación XSLT.","Es el atributo que permite definir la versión de XSLT que se utiliza para especificar las reglas de transformación del documento XML."],"solucion":"Es el atributo que permite definir la versión de XSLT que se utiliza para especificar las reglas de transformación del documento XML."},
{"id":13,"enunciado":"Operador de secuencia que se usa para obtener la unión de dos secuencias de nodos sin repetir ninguno.","respuestas":["except","intersect","union"],"solucion":"except"},
{"id":14,"enunciado":"Característica que tienen los lenguajes de programación del tipo script respecto a las variables.","respuestas":["No es necesario declararlas ni asignarles un tipo de dato.","Es necesario declararlas y asignarles un tipo de dato.","Es necesario declararlas pero no asignarles un tipo de dato."],"solucion":"No es necesario declararlas ni asignarles un tipo de dato."},
{"id":15,"enunciado":"¿Qué es XML?","respuestas":["Un metalenguaje extensible de etiquetas desarrollado por el W3C.","Un lenguaje de marcado para la presentación de páginas web.","Un lenguaje de programación orientado a objetos desarrollado por IBM."],"solucion":"Un metalenguaje extensible de etiquetas desarrollado por el W3C."},
{"id":16,"enunciado":"¿Qué elemento XSL se utiliza para copiar el conjunto de nodos seleccionado por una expresión XPath al documento resultado?","respuestas":["<xsl:clone>","<xsl:copy>","<xsl:copy-of>"],"solucion":"<xsl:copy>"},
{"id":17,"enunciado":"¿Qué método se utiliza para eliminar un atributo de su elemento primario en XML?","respuestas":["Remove","Erase","Delete"],"solucion":"Remove"},
{"id":18,"enunciado":"Las entidades predefinidas en XML son…","respuestas":["Son las partes del documento XML que entiende el parser, que empiezan con “<” y que acaban con “>”.","Son los caracteres especiales de marcado que se representan con una referencia de entidad, que empieza por “&” y acaba con “;”.","Son los mensajes enviados al procesador, que comienzan con “<?” y finalizan con “?>”."],"solucion":"Son los caracteres especiales de marcado que se representan con una referencia de entidad, que empieza por “&” y acaba con “;”."},
{"id":19,"enunciado":"¿Qué símbolos se utilizan para indicar el inicio y el fin de un comentario en XML?","respuestas":["<!-- y -->","// y //","/* y */"],"solucion":"<!-- y -->"},
{"id":20,"enunciado":"¿Qué marca se utiliza para especificar el tipo de documento XML al inicio del mismo?","respuestas":["<?xml … ?>","<!DOCTYPE … >","<!ELEMENT … >"],"solucion":"<?xml … ?>"},
{"id":21,"enunciado":"¿Cuál es el tipo de elementos XML que se pueden representar de forma abreviada con una sola etiqueta?","respuestas":["Elementos sin atributos y con datos","Elementos con atributos sin datos","Elementos vacíos"],"solucion":"Elementos vacíos"},
{"id":22,"enunciado":"El tipo de procesado XSLT que se produce cuando los archivos fuente y las hojas de estilo se mandan al navegador del usuario es…","respuestas":["Procesado en el cliente","Procesado en el servidor","Procesado en el disco"],"solucion":"Procesado en el cliente"},
{"id":23,"enunciado":"¿Qué tipo de consulta se utiliza para extraer datos de documentos XML en la web?","respuestas":["XSLT","XQL","XPath"],"solucion":"XQL"},
{"id":24,"enunciado":"Lenguaje de script de cliente que se utiliza para interactuar con los elementos de una página web a través del DOM.","respuestas":["Python","PHP","JavaScript"],"solucion":"JavaScript"},
{"id":25,"enunciado":"¿Cuáles son el tipo de herramientas que permiten crear documentos XML en modo online, a través de un navegador web?","respuestas":["Editores web.","Navegadores web.","Herramientas de creación y validación."],"solucion":"Editores web."},
{"id":26,"enunciado":"¿Qué tecnología se utiliza para realizar consultas sobre los elementos de un documento XML?","respuestas":["LINQ","XSLT","SQL"],"solucion":"LINQ"},
{"id":27,"enunciado":"El lenguaje de consulta que se usa para obtener el contenido de los documentos XML en BaseX es…","respuestas":["XMLmind","XQuery","SQL"],"solucion":"XQuery"},
{"id":28,"enunciado":"Conjunto de tipos de datos que se puede usar en XQuery sin importar ningún esquema.","respuestas":["Los predefinidos","Los importados","Los simples"],"solucion":"Los predefinidos"},
{"id":29,"enunciado":"¿Qué lenguaje de script de cliente es de tipado dinámico y permite la programación orientada a objetos, imperativa y funcional?","respuestas":["PHP","Python","JavaScript"],"solucion":"JavaScript"},
{"id":30,"enunciado":"¿Cómo se denomina al valor que se obtiene al aplicar la expresión <xsl:value-of/> a un nodo XML?","respuestas":["El atributo del nodo","El contenido del nodo","El nombre del nodo"],"solucion":"El contenido del nodo"},
{"id":31,"enunciado":"¿Qué estándar regula el funcionamiento de JavaScript y cómo debe ser interpretado?","respuestas":["CSS","ECMAScript","HTML"],"solucion":"ECMAScript"},
{"id":32,"enunciado":"Los lenguajes de marcas son…","respuestas":["Una forma de traducir un documento, empleando una serie de códigos junto al texto o información, mediante una estructura y lógica determinadas.","Una forma de escribir un documento, usando una serie de símbolos junto al texto o información, mediante una estructura y gramática determinadas.","Una forma de codificar un documento, incorporando una serie de etiquetas junto al texto o información, mediante una estructura y sintaxis determinadas."],"solucion":"Una forma de codificar un documento, incorporando una serie de etiquetas junto al texto o información, mediante una estructura y sintaxis determinadas."},
{"id":33,"enunciado":"¿Qué significa XSLT?","respuestas":["Extended Stylesheet Language Transformation","Extensible Style Language Transformation","Extensible Stylesheet Language Transformation"],"solucion":"Extensible Stylesheet Language Transformation"},
{"id":34,"enunciado":"¿Qué significa XML?","respuestas":["Extensible Markup Language","Extensible Microsoft Language","Extensible Market Language"],"solucion":"Extensible Markup Language"},
{"id":35,"enunciado":"Un documento bien formado en XML es…","respuestas":["Un documento que contiene la declaración del tipo de documento y la definición del tipo de documento (DTD).","Un documento que respeta la sintaxis de XML en sus documentos, cumpliendo las reglas generales de diseño.","Un documento que valida la estructura de XML según las reglas definidas en el DTD o XML Schema."],"solucion":"Un documento que respeta la sintaxis de XML en sus documentos, cumpliendo las reglas generales de diseño."},
{"id":36,"enunciado":"¿Qué es un constructor en XQuery?","respuestas":["Una función que crea un tipo particular a partir de un valor y una cadena","Una función que crea una cadena a partir de un valor de un tipo particular","Una función que crea un valor de un tipo particular a partir de una cadena"],"solucion":"Una función que crea un valor de un tipo particular a partir de una cadena"},
{"id":37,"enunciado":"¿Qué elemento XSL se utiliza para copiar el nodo contexto y sus hijos al documento resultado?","respuestas":["<xsl:copy-of>","<xsl:clone>","<xsl:copy>"],"solucion":"<xsl:copy>"},
{"id":38,"enunciado":"¿Cuál es el tipo de atributo XML que permite definir una lista predeterminada de valores que puede tomar el atributo?","respuestas":["Enumerado.","ID.","CDATA."],"solucion":"Enumerado."},
{"id":39,"enunciado":"¿Qué cláusula se usa para filtrar las tuplas que cumplen una condición?","respuestas":["return","for","where"],"solucion":"where"},
{"id":40,"enunciado":"El tipo de documento que se utiliza para especificar el atributo href de la instrucción <?xml-stylesheet?> en un documento XML es…","respuestas":["Un documento XML","Un documento XSL","Un documento HTML"],"solucion":"Un documento XSL"},
{"id":41,"enunciado":"Editor de código fuente libre y multiplataforma que ha sido desarrollado por Microsoft.","respuestas":["Notepad++.","Visual Studio Code.","Sublime Text."],"solucion":"Visual Studio Code."},
{"id":42,"enunciado":"¿Qué es un lenguaje de programación del lado cliente?","respuestas":["Un lenguaje que se utiliza para definir la estructura y el contenido de una página web.","Un lenguaje que se ejecuta en el navegador del usuario y permite crear páginas web dinámicas.","Un lenguaje que se ejecuta en el servidor web y permite procesar los datos enviados por el usuario."],"solucion":"Un lenguaje que se ejecuta en el navegador del usuario y permite crear páginas web dinámicas."},
{"id":43,"enunciado":"¿Qué cláusula se usa para asignar una variable al resultado global de una expresión?","respuestas":["order by","for","let"],"solucion":"let"},
{"id":44,"enunciado":"El acrónimo que se usa para referirse al lenguaje de consulta estructurado que se usa en los sistemas gestores de bases de datos relacionales es…","respuestas":["SQL","XML","DDL"],"solucion":"SQL"},
{"id":45,"enunciado":"El tipo de elemento XSLT permite crear variables de números es…","respuestas":["xsl:text","xsl:variable","xsl:number"],"solucion":"xsl:number"},
{"id":46,"enunciado":"¿Qué lenguaje de script de servidor fue diseñado originalmente para el desarrollo de sitios web dinámicos y puede ser incluido directamente en el código HTML?","respuestas":["JavaScript","PHP","Python"],"solucion":"PHP"},
{"id":47,"enunciado":"Los elementos en XML son…","respuestas":["Son la unidad básica del documento, donde se almacena la información a transmitir, con sus correspondientes etiquetas.","Son los valores que se asignan a los atributos, ampliando o describiendo la información sobre ellos o que queremos transmitir.","Son los grupos de caracteres que requieren ser analizados por el procesador."],"solucion":"Son la unidad básica del documento, donde se almacena la información a transmitir, con sus correspondientes etiquetas."},
{"id":48,"enunciado":"¿Qué es el elemento raíz en XML?","respuestas":["Es el último elemento que aparece en el documento, designado con “//”.","Es el elemento que contiene todos los demás elementos del documento, designado con “*”.","Es el primer elemento que aparece en el documento, designado con “/”."],"solucion":"Es el primer elemento que aparece en el documento, designado con “/”."},
{"id":49,"enunciado":"Método que se utiliza para cargar un documento XML desde un archivo.","respuestas":["ReadFrom","Load","Parse"],"solucion":"Load"},
{"id":50,"enunciado":"¿Cuál es el tipo de dato que se usa para representar números con decimales en XQuery?","respuestas":["xs:float","xs:decimal","xs:double"],"solucion":"xs:decimal"},
{"id":51,"enunciado":"Operador de secuencia que se usa para obtener la unión de dos secuencias de nodos sin repetir ninguno.","respuestas":["intersect","union","except"],"solucion":"union"},
{"id":52,"enunciado":"¿Qué es XPath?","respuestas":["Un lenguaje que permite escribir expresiones matemáticas para calcular valores en un documento XML.","Un lenguaje que permite escribir expresiones regulares para recorrer y procesar un documento XML.","Un lenguaje que permite escribir expresiones lógicas para validar un documento XML."],"solucion":"Un lenguaje que permite escribir expresiones regulares para recorrer y procesar un documento XML."},
{"id":53,"enunciado":"¿Qué indica la palabra SYSTEM en la declaración del tipo de documento?","respuestas":["Que el documento XML es de tipo sistema.","Que el documento XML tiene una definición de tipo externa.","Que el documento XML tiene un sistema de validación."],"solucion":"Que el documento XML tiene una definición de tipo externa."},
{"id":54,"enunciado":"¿Cuál es el tipo de elementos XML que no contienen datos, sino sólo atributos?","respuestas":["Elementos sin atributos y con datos","Elementos con atributos sin datos","Elementos vacíos"],"solucion":"Elementos con atributos sin datos"},
{"id":55,"enunciado":"¿Qué es Visual Studio Code?","respuestas":["Es un editor de texto que ofrece ayuda en la consulta y la extracción de datos de XML, realizando búsquedas y filtros, ordenando y agrupando los resultados y creando informes.","Es un editor de texto que ofrece ayuda en la transformación y la presentación de XML, aplicando estilos y formatos, generando tablas y gráficos y validando los documentos.","Es un editor de texto que ofrece ayuda en la escritura de código y el manejo de XML, reconociendo la gramática y la sintaxis, coloreando los textos y desplegando los elementos."],"solucion":"Es un editor de texto que ofrece ayuda en la escritura de código y el manejo de XML, reconociendo la gramática y la sintaxis, coloreando los textos y desplegando los elementos."},
{"id":56,"enunciado":"¿Cuáles son el tipo de herramientas que presentan los documentos XML en forma de árbol que permite expandir o comprimir sus ramas?","respuestas":["Navegadores web.","Editores web.","Herramientas de creación y validación."],"solucion":"Navegadores web."},
{"id":57,"enunciado":"Ventaja que tiene XML respecto a HTML.","respuestas":["Permite la inclusión de elementos multimedia como imágenes, vídeos o sonidos.","Permite la definición de estilos y formatos para los elementos de un documento.","Permite la compatibilidad entre sistemas para compartir información de manera segura, fiable y fácil."],"solucion":"Permite la compatibilidad entre sistemas para compartir información de manera segura, fiable y fácil."},
{"id":58,"enunciado":"¿Qué es el atributo targetNamespace en XML Schema?","respuestas":["Es el atributo que permite definir el espacio de nombres al que pertenecen los elementos y atributos definidos en el esquema XML, que debe ser una URI válida.","Es el atributo que permite definir el espacio de nombres al que pertenece el esquema XML, que debe ser una URI válida.","Es el atributo que permite definir el espacio de nombres al que pertenecen los documentos XML que se validan con el esquema XML, que debe ser una URI válida."],"solucion":"Es el atributo que permite definir el espacio de nombres al que pertenecen los elementos y atributos definidos en el esquema XML, que debe ser una URI válida."},
{"id":59,"enunciado":"Tecnología que se usa para vincular partes específicas de un documento XML.","respuestas":["XSLT","XPointer","XPath"],"solucion":"XPointer"},
{"id":60,"enunciado":"¿Cuál es el tipo de documento que se utiliza para definir las reglas de transformación de un documento XML en otro?","respuestas":["Un documento XSL","Un documento DTD","Un documento CSS"],"solucion":"Un documento XSL"},
{"id":61,"enunciado":"Ventaja que tiene la programación del lado cliente respecto a la del lado servidor.","respuestas":["Permite acceder a los recursos del sistema operativo del usuario y modificarlos.","Libera al servidor de carga de procesamiento y disminuye el tráfico de red.","Garantiza la compatibilidad con todos los navegadores y sistemas operativos."],"solucion":"Libera al servidor de carga de procesamiento y disminuye el tráfico de red."},
{"id":62,"enunciado":"¿Cuál es el tipo de datos que se pueden almacenar en un elemento XML sin atributos?","respuestas":["Cualquier tipo de datos","Sólo datos numéricos","Sólo datos de texto"],"solucion":"Cualquier tipo de datos"},
{"id":63,"enunciado":"¿Cuáles son el tipo de datos que se almacenan en los sistemas nativos XML?","respuestas":["Documentos","Tablas","Objetos"],"solucion":"Documentos"},
{"id":64,"enunciado":"El operador aritmético que se usa para obtener el resto de una división entera es…","respuestas":["div","idiv","mod"],"solucion":"mod"},
{"id":65,"enunciado":"¿Cuál es el tipo de fichero que se utiliza para definir la estructura de un documento XML?","respuestas":["CSS","XSLT","DTD"],"solucion":"DTD"},
{"id":66,"enunciado":"¿Qué caracteriza a una variable en XQuery?","respuestas":["Empieza con el signo dólar y se usa para representar un valor","Empieza con el signo asterisco y se usa para representar un elemento","Empieza con el signo arroba y se usa para representar un atributo"],"solucion":"Empieza con el signo dólar y se usa para representar un valor"},
{"id":67,"enunciado":"El tipo de elemento XSLT que permite realizar procesamiento condicional según una expresión indicada en el atributo test es…","respuestas":["xsl:choose","xsl:if","xsl:when"],"solucion":"xsl:if"},
{"id":68,"enunciado":"¿Cómo se denomina al proceso consistente en extraer el valor con tipo de un elemento en XQuery?","respuestas":["Autentificación","Automatización","Atomización"],"solucion":"Atomización"},
{"id":69,"enunciado":"¿Cuáles son el tipo de elementos que puede incluir un documento XSL además de los definidos por XSLT?","respuestas":["Elementos de otros documentos XML","Elementos de otros tipos de ficheros","Elementos de otros espacios de nombres"],"solucion":"Elementos de otros espacios de nombres"},
{"id":70,"enunciado":"El tipo de documento que se obtiene como resultado de una transformación XSLT es…","respuestas":["Un documento XML","Un documento basado en texto","Un documento binario"],"solucion":"Un documento basado en texto"},
{"id":71,"enunciado":"¿Cómo se denomina al tipo de transformación que permite convertir un documento XML en otro formato como HTML, RTF o PDF?","respuestas":["XSLT","XSL","XPath"],"solucion":"XSLT"},
{"id":72,"enunciado":"Método que se utiliza para cargar un documento XML desde una cadena de texto.","respuestas":["Load","Parse","ReadFrom"],"solucion":"Parse"},
{"id":73,"enunciado":"¿Cuáles son el tipo de plantillas que tienen la misma prioridad que las plantillas locales cuando se usan elementos xsl:include?","respuestas":["Las plantillas importadas","Las plantillas duplicadas","Las plantillas incorporadas"],"solucion":"Las plantillas incorporadas"},
{"id":74,"enunciado":"¿Qué es una transformación en XQuery?","respuestas":["El paso de una representación léxica del modelo de datos a una instancia de este modelo","El paso de una instancia del modelo de datos a otra instancia de este modelo","El paso de una instancia del modelo de datos a una representación léxica de este modelo"],"solucion":"El paso de una instancia del modelo de datos a otra instancia de este modelo"},
{"id":75,"enunciado":"Tecnología XML que permite crear enlaces entre recursos XML.","respuestas":["XPointer","XQL","XLink"],"solucion":"XLink"},
{"id":76,"enunciado":"El atributo standalone en XML es…","respuestas":["Es el atributo que permite indicar si el documento XML depende o no de una DTD externa.","Es el atributo que permite definir el espacio de nombres de los elementos o de los atributos que lleven los elementos.","Es el atributo que permite definir el lenguaje del contenido o de los valores de atributos que lleven los elementos."],"solucion":"Es el atributo que permite indicar si el documento XML depende o no de una DTD externa."},
{"id":77,"enunciado":"¿Qué es el atributo xml:lang en XML?","respuestas":["Es el atributo que permite definir el lenguaje del contenido o de los valores de atributos que lleven los elementos.","Es el atributo que permite definir el tratamiento de los espacios en blanco en el contenido o en los valores de atributos que lleven los elementos.","Es el atributo que permite definir el espacio de nombres de los elementos o de los atributos que lleven los elementos."],"solucion":"Es el atributo que permite definir el lenguaje del contenido o de los valores de atributos que lleven los elementos."},
{"id":78,"enunciado":"¿Qué es XSL?","respuestas":["Un lenguaje de enlace XML que permite insertar elementos en los documentos para crear enlaces entre recursos XML.","Un lenguaje de rutas XML que permite el acceso a las distintas partes de los documentos XML.","Un lenguaje de transformación XML que permite mostrar cómo debería estar estructurado el contenido para una correcta presentación en los distintos soportes de visualización."],"solucion":"Un lenguaje de transformación XML que permite mostrar cómo debería estar estructurado el contenido para una correcta presentación en los distintos soportes de visualización."},
{"id":79,"enunciado":"La estructura que siguen los documentos XML respecto a las etiquetas que delimitan sus elementos es…","respuestas":["Una estructura libre y flexible.","Una estructura lineal y secuencial.","Una estructura estrictamente jerárquica."],"solucion":"Una estructura estrictamente jerárquica."},
{"id":80,"enunciado":"¿Qué indica la declaración del documento en el prólogo de un documento XML?","respuestas":["El tipo de documento XSLT que es.","El tipo de documento XML que es.","El tipo de documento HTML que es."],"solucion":"El tipo de documento XML que es."},
{"id":81,"enunciado":"Lenguaje que se usa para realizar consultas en bases de datos relacionales.","respuestas":["SQL","XML","XQuery"],"solucion":"SQL"},
{"id":82,"enunciado":"¿Cuál es el tipo de contenido que puede tener un elemento XML según su declaración de tipo?","respuestas":["Elementos, atributos, texto o vacío.","Elementos, entidades, texto o vacío.","Elementos, notaciones, texto o vacío."],"solucion":"Elementos, entidades, texto o vacío."},
{"id":83,"enunciado":"Cláusula que se usa para insertar un nivel de jerarquía en un elemento XML en XQuery.","respuestas":["constructor","element","créate"],"solucion":"element"},
{"id":84,"enunciado":"¿Qué es XML?","respuestas":["Un lenguaje de programación que sirve para crear aplicaciones web.","Un metalenguaje que sirve de base en la construcción de otros lenguajes.","Un lenguaje de marcas que sirve para definir la presentación de los documentos."],"solucion":"Un metalenguaje que sirve de base en la construcción de otros lenguajes."},
{"id":85,"enunciado":"¿Cuál es el tipo de marcado XML que identifica el nombre del archivo que queremos añadir al documento?","respuestas":["Elemento.","Atributo.","Entidad."],"solucion":"Entidad."},
{"id":86,"enunciado":"¿Qué tipo de consultas se usan para crear, modificar o eliminar las estructuras de datos en una base de datos relacional?","respuestas":["Data Manipulation Language (DML)","Data Control Language (DCL)","Data Definition Language (DDL)"],"solucion":"Data Definition Language (DDL)"},
{"id":87,"enunciado":"Un editor de texto es…","respuestas":["Es un programa que permite crear, editar o modificar documentos XML, usando el propio lenguaje XML.","Es un programa que permite transformar, presentar o validar documentos XML, usando otros lenguajes como XSL, XSLT o XSD.","Es un programa que permite consultar, extraer o manipular datos de documentos XML, usando otros lenguajes como XPath, XQuery o XLink."],"solucion":"Es un programa que permite crear, editar o modificar documentos XML, usando el propio lenguaje XML."},
{"id":88,"enunciado":"¿Qué son las entidades en XML?","respuestas":["Unidades de validación que pueden comprobar la corrección del documento según un esquema","Unidades de procesamiento que pueden ejecutar operaciones sobre los datos del documento","Unidades de almacenamiento que pueden contener desde un carácter hasta el nombre de un fichero"],"solucion":"Unidades de almacenamiento que pueden contener desde un carácter hasta el nombre de un fichero"},
{"id":89,"enunciado":"El elemento que debe tener obligatoriamente un documento XML al inicio del mismo es…","respuestas":["Una declaración XML","Una cabecera HTML","Un elemento raíz"],"solucion":"Una declaración XML"},
{"id":90,"enunciado":"¿Qué es XSLT?","respuestas":["Un lenguaje de validación que permite comprobar la corrección sintáctica y semántica de los documentos XML.","Un lenguaje de transformación que permite definir el modo de transformación de un documento XML en otro.","Un lenguaje de consulta que permite acceder a los distintos componentes que forman los documentos XML."],"solucion":"Un lenguaje de transformación que permite definir el modo de transformación de un documento XML en otro."},
{"id":91,"enunciado":"La función se usa para convertir un valor a decimal en XQuery es…","respuestas":["xs:decimal()","decimal()","to-decimal()"],"solucion":"xs:decimal()"},
{"id":92,"enunciado":"La función que se usa para obtener el número de elementos título en el documento libros.xml es…","respuestas":["size()","count()","length()"],"solucion":"count()"},
{"id":93,"enunciado":"¿Qué tipo de enlaces soporta XLink?","respuestas":["Unidireccionales","Bidireccionales","Ambos"],"solucion":"Ambos"},
{"id":94,"enunciado":"El tipo de elemento XSLT que permite crear variables de vínculos de datos es…","respuestas":["xsl:text","xsl:variable","xsl:number"],"solucion":"xsl:variable"},
{"id":95,"enunciado":"¿Cuál es el tipo de elemento XSLT que permite iterar a través de un conjunto de nodos del documento fuente?","respuestas":["xsl:apply-templates","xsl:for-each","xsl:template"],"solucion":"xsl:for-each"},
{"id":96,"enunciado":"Elemento XSL que se utiliza para iterar sobre todos los nodos que coinciden con una expresión XPath.","respuestas":["<xsl:for-each>","<xsl:loop>","<xsl:repeat>"],"solucion":"<xsl:for-each>"},
{"id":97,"enunciado":"¿Qué tipo de elemento XSLT permite crear variables de texto normal?","respuestas":["xsl:variable","xsl:number","xsl:text"],"solucion":"xsl:text"}]