[{"id":0,"enunciado":"El protocolo TCP:","respuestas":["Es un protocolo de comunicaciones con conexión y no confiable","Es un protocolo de comunicaciones orientado a la conexión","Es un protocolo de comunicaciones sin conexión y no confiable"],"solucion":"Es un protocolo de comunicaciones orientado a la conexión"},
{"id":1,"enunciado":"¿Qué dirección IP utilizaremos si queremos enviar el mensaje al ordenador local?:","respuestas":["127.0.0.1","127.1.1.1","127.1.0.0"],"solucion":"127.0.0.1"},
{"id":2,"enunciado":"Indica el paso que no realiza un emisor UDP:","respuestas":["Publicar puerto","Envío y recepción de datos","Cerrar socket"],"solucion":"Publicar puerto"},
{"id":3,"enunciado":"¿Qué protocolo utilizarías para una aplicación que envía un fichero de texto?:","respuestas":["UDP","SSH","TCP"],"solucion":"TCP"},
{"id":4,"enunciado":"¿Cuál de los siguientes es un tipo de socket basado en protocolo TCP y orientado a la conexión?:","respuestas":["SSH","Datagrama","Stream"],"solucion":"Stream"},
{"id":5,"enunciado":"La capa de acceso a la red:","respuestas":["Se encarga de ofrecer la capacidad de acceder a cualquier red física","Se encarga de permitir que los nodos incluyan paquetes en cualquier red y viajen de forma independiente a su destino.","Contiene los protocolos de más alto nivel como son SMTP, FTP, etc."],"solucion":"Se encarga de ofrecer la capacidad de acceder a cualquier red física"},
{"id":6,"enunciado":"En un receptor UDP se utiliza la función:","respuestas":["DatagramSocket","DataInputStream","DatagramPacket"],"solucion":"DatagramPacket"},
{"id":7,"enunciado":"¿En qué nivel del modelo OSI se encuentra el protocolo TCP?:","respuestas":["Sesión","Transporte","Red"],"solucion":"Transporte"},
{"id":8,"enunciado":"Indica la capa que se encarga de enrutar un paquete por la red para que llegue a su destino:","respuestas":["Aplicación","Transporte","Red"],"solucion":"Red"},
{"id":9,"enunciado":"¿Qué función permite al servidor publicar un puerto?:","respuestas":["Accept","ServerSocket","ExportSocket"],"solucion":"ServerSocket"},
{"id":10,"enunciado":"¿Qué es FTP?:","respuestas":["Es un protocolo de red utilizado para el intercambio de mensajes de correo electrónico entre computadoras u otros dispositivos","Es generalmente un conjunto de herramientas de desarrollo de software que le permite al programador crear aplicaciones para un sistema concreto","Es un protocolo de red para la transferencia de archivos entre sistemas conectados a una red TCP (Transmission Control Protocol), basado en la arquitectura cliente-servidor"],"solucion":"Es un protocolo de red para la transferencia de archivos entre sistemas conectados a una red TCP (Transmission Control Protocol), basado en la arquitectura cliente-servidor"},
{"id":11,"enunciado":"¿Qué operaciones hay que realizar para optimizar la utilización de sockets en una aplicación cliente/servidor?:","respuestas":["Solo asegurar el sistema","Solo monitorizar los tiempos de respuesta","Monitorizar los tiempos de respuesta, asegurar el sistema y atender múltiples peticiones"],"solucion":"Monitorizar los tiempos de respuesta, asegurar el sistema y atender múltiples peticiones"},
{"id":12,"enunciado":"Un puerto nos permite:","respuestas":["Identificar de manera única una aplicación","Identificar de manera única un equipo en la red","Identificar una aplicación a la que van dirigidos los datos dentro de un equipo"],"solucion":"Identificar una aplicación a la que van dirigidos los datos dentro de un equipo"},
{"id":13,"enunciado":"El protocolo TCP :","respuestas":["Tiene 7 capas (física, enlace, red, transporte, sesión, presentación y aplicación)","Tiene 2 capas (TCP e IP)","Tiene 4 capas (acceso a red, Internet, transporte y aplicación)"],"solucion":"Tiene 4 capas (acceso a red, Internet, transporte y aplicación)"},
{"id":14,"enunciado":"El acierto de Internet ha sido:","respuestas":["Ha sido la nula estandarización de un conjunto de servicios que podríamos denominar “básicos”, que son capaces de soportar nuevos servicios de más bajo nivel, garantizando así la interoperabilidad de todos ellos, necesitando nuevas instalaciones e instalaciones de nuevo software en los clientes que tenga que utilizarlos.","Ha sido el uso de navegadores como Internet Explorer","Ha sido la estandarización de un conjunto de servicios que podríamos denominar “básicos”, que son capaces de soportar nuevos servicios de más alto nivel, garantizando así la interoperabilidad de todos ellos, sin necesidad de nuevas instalaciones ni cambios de software en ninguno de los clientes que tenga que utilizarlos."],"solucion":"Ha sido la estandarización de un conjunto de servicios que podríamos denominar “básicos”, que son capaces de soportar nuevos servicios de más alto nivel, garantizando así la interoperabilidad de todos ellos, sin necesidad de nuevas instalaciones ni cambios de software en ninguno de los clientes que tenga que utilizarlos."},
{"id":15,"enunciado":"POP3 y SMTP:","respuestas":["Son protocolos utilizados para enviar mensajes de email de clientes a servidores a través de Internet","Son protocolos que se utilizan para transferir información entre clientes web y servidores web","Son servicios orientados a distribuir archivos de música"],"solucion":"Son protocolos utilizados para enviar mensajes de email de clientes a servidores a través de Internet"},
{"id":16,"enunciado":"El protocolo FTP:","respuestas":["Contempla algunos aspectos de seguridad basados en SSL","Es uno de los más seguros","Tiene importantes deficiencias de seguridad"],"solucion":"Tiene importantes deficiencias de seguridad"},
{"id":17,"enunciado":"¿Qué protocolo es utilizado para transferir archivos entre sistemas:","respuestas":["TELNET","HTTP","FTP"],"solucion":"FTP"},
{"id":18,"enunciado":"Cuando hablamos de servicios de correo electrónico:","respuestas":["Hablamos de sistemas operativos basados en el protocolo OSI","Nos referimos a los servicios de gestión de los mensajes transmitidos por la red","Básicamente nos referimos a dos servicios diferentes que colaboran para conseguir transmitir un mensaje digital desde el dispositivo del autor (remitente) al dispositivo del destinatario."],"solucion":"Básicamente nos referimos a dos servicios diferentes que colaboran para conseguir transmitir un mensaje digital desde el dispositivo del autor (remitente) al dispositivo del destinatario."},
{"id":19,"enunciado":"El éxito de la red global:","respuestas":["Ha sido el desarrollo de una conectividad barata y eficiente.","Ha sido la falta de definición de protocolos para el intercambio de información","Ha sido el desarrollo de una conectividad a unos precios bastante elevados"],"solucion":"Ha sido el desarrollo de una conectividad barata y eficiente."},
{"id":20,"enunciado":"Los protocolos criptográficos:","respuestas":["Son protocolos que utilizan algoritmos o métodos gráficos con el objetivo de conseguir algún objetivo en cuestión de usabilidad","No hay quién los entienda","Son protocolos que utilizan algoritmos o métodos criptográficos con el objetivo de conseguir algún objetivo en cuestión de seguridad"],"solucion":"Son protocolos que utilizan algoritmos o métodos criptográficos con el objetivo de conseguir algún objetivo en cuestión de seguridad"},
{"id":21,"enunciado":"¿Cuál es el beneficio más importante de la criptografía de clave simétrica?:","respuestas":["Es su velocidad lo cual hace que este tipo de algoritmos sean los más apropiados para el cifrado de grandes cantidades de datos","Es la necesidad de distribuir la clave que se emplea para el cifrado por lo que, si alguien consigue hacerse tanto con el mensaje como con la clave utilizada, podrá descifrar el mensaje","Es la supresión de la necesidad del envío de la clave, siendo por lo tanto un sistema más seguro"],"solucion":"Es su velocidad lo cual hace que este tipo de algoritmos sean los más apropiados para el cifrado de grandes cantidades de datos"},
{"id":22,"enunciado":"La auditoría consiste en :","respuestas":["Comprobar la identidad del usuario que accede a la aplicación. Este proceso se realiza en dos pasos.","Conservar un historial de la aplicación donde se almacene quien la ha realizado, cuando, que permisos tienen los usuarios, etc.","La presentación de toda la información que nos requieran para comprobar que el cifrado se realiza de forma correcta"],"solucion":"Conservar un historial de la aplicación donde se almacene quien la ha realizado, cuando, que permisos tienen los usuarios, etc."},
{"id":23,"enunciado":"¿Qué tipo de criptografía utiliza la misma clave privada tanto para la encriptación como para la desencriptación?:","respuestas":["Asimétrico","Simétrico","Paralelo"],"solucion":"Simétrico"},
{"id":24,"enunciado":"PGP:","respuestas":["Es un protocolo que cifra el contenido del mensaje a intercambiar entre emisor y receptor. En este caso utiliza algoritmos de clave simétrica y asimétrica. Garantiza la integridad de la información, la confidencialidad, la autenticación y no repudio.","Es un protocolo utilizado para asegurar las transacciones de Internet en las que se necesita tarjeta de crédito.","Se trata de un conjunto de protocolos que permiten asegurar las comunicaciones sobre el protocolo IP autenticando y / o cifrando los paquetes IP"],"solucion":"Es un protocolo que cifra el contenido del mensaje a intercambiar entre emisor y receptor. En este caso utiliza algoritmos de clave simétrica y asimétrica. Garantiza la integridad de la información, la confidencialidad, la autenticación y no repudio."},
{"id":25,"enunciado":"Los principales métodos de encriptación son:","respuestas":["Criptografía de clave osimétrica y criptografía de clave perimétrica","Criptografía de clave endométrica y criptografía de clave métrica","Criptografía de clave simétrica y criptografía de clave asimétrica"],"solucion":"Criptografía de clave simétrica y criptografía de clave asimétrica"},
{"id":26,"enunciado":"Para firmar :","respuestas":["Se utiliza un sistema de clave simétrica en el que el receptor desconoce la clave utilizada para el cifrado.","Se utiliza un sistema de clave asimétrica en el que se cuentan con dos claves, una privada y otra pública.","Los mensajes que se transmiten no puedan ser conocidos por otras personas."],"solucion":"Se utiliza un sistema de clave asimétrica en el que se cuentan con dos claves, una privada y otra pública."},
{"id":27,"enunciado":"La criptografía:","respuestas":["Es la técnica que permite generar mensajes o hacerlos legibles","Está relacionada con la antropología","Es la técnica que permite cifrar mensajes o hacerlos ininteligibles"],"solucion":"Es la técnica que permite cifrar mensajes o hacerlos ininteligibles"},
{"id":28,"enunciado":"Indique cuál es un algoritmo de tipo asimétrico:","respuestas":["DES","XLS","RSA"],"solucion":"RSA"},
{"id":29,"enunciado":"El protocolo utilizado para asegurar las transacciones de Internet en las que se necesita tarjeta de crédito es:","respuestas":["POINT","SSL","SET"],"solucion":"SET"},
{"id":30,"enunciado":"¿Cómo se llama el mecanismo proporcionado por el lenguaje Java para acceso a métodos remotos?:","respuestas":["JSSE (Java Secure Socket Extension)","Java WSDL","Java RMI"],"solucion":"Java RMI"},
{"id":31,"enunciado":"La autenticación:","respuestas":["Permite conservar un historial de la aplicación","Permite comprobar la identidad del usuario que accede a la aplicación","Permite definir los privilegios de un usuario en una aplicación"],"solucion":"Permite comprobar la identidad del usuario que accede a la aplicación"},
{"id":32,"enunciado":"¿Qué característica no es propia del modelo cliente/servidor?:","respuestas":["El cliente interactúa con el usuario y el servidor interactúa con los recursos compartidos","Existe una clara distinción de funciones basada en el concepto de servicio","El recurso compartido se encuentra en los equipos clientes"],"solucion":"El recurso compartido se encuentra en los equipos clientes"},
{"id":33,"enunciado":"El paquete java.net:","respuestas":["Se utiliza para conectar nuestra aplicación a Internet","No es un paquete de Java","Provee la implementación de las clases necesarias para las aplicaciones en red."],"solucion":"Provee la implementación de las clases necesarias para las aplicaciones en red."},
{"id":34,"enunciado":"¿Qué es un servicio web?:","respuestas":["Un protocolo seguro de transferencia de datos basado en el protocolo HTTP","Un conjunto de clases utilizadas para ejecutar las operaciones necesarias para invocar el protocolo SSL desde el código fuente de Java","Es una tecnología que sirve para intercambiar datos entre aplicaciones a través de internet y que utiliza un conjunto de protocolos y estándares"],"solucion":"Es una tecnología que sirve para intercambiar datos entre aplicaciones a través de internet y que utiliza un conjunto de protocolos y estándares"},
{"id":35,"enunciado":"El cifrado de clave privada o simétrica:","respuestas":["Consiste en la utilización de una única clave para el cifrado y descrifrado del mensaje enviado","Consiste en la utilización de una clave pública para el cifrado y una privada para el descrifrado del mensaje enviado","Consiste en la utilización de una varias claves para el cifrado y descrifrado del mensaje enviado"],"solucion":"Consiste en la utilización de una única clave para el cifrado y descrifrado del mensaje enviado"},
{"id":36,"enunciado":"El cifrado de clave pública o asimétrica:","respuestas":["Es un método que permite generar un número que representa de manera única a un documento o conjunto de datos","Consiste en la utilización de una única clave para el cifrado y descrifrado del mensaje enviado","Consiste en la utilización de dos claves, una pública para el cifrado y una privada o secreta para el descifrado."],"solucion":"Consiste en la utilización de dos claves, una pública para el cifrado y una privada o secreta para el descifrado."},
{"id":37,"enunciado":"Los servicios de mensajería:","respuestas":["Son los que incluyen las aplicaciones de red necesarias para almacenar y recuperar datos de archivos","Son los que proveen bases de datos a los clientes de la red de manera que éstos puedan almacenar y recuperar los datos para así controlar la manipulación y presentación de éstos","Son los que incluyen las aplicaciones necesarias para almacenar, acceder y entregar los mensajes"],"solucion":"Son los que incluyen las aplicaciones necesarias para almacenar, acceder y entregar los mensajes"},
{"id":38,"enunciado":"El funcionamiento de la criptografía :","respuestas":["Consiste en la publicación de códigos Java para obtener datos confidenciales que circulan por Internet o cualquier red en general","Es bastante criptográfico","Consiste en la utilización de códigos para escribir datos confidenciales que circulan por Internet o cualquier red en general"],"solucion":"Consiste en la utilización de códigos para escribir datos confidenciales que circulan por Internet o cualquier red en general"},
{"id":39,"enunciado":"¿Qué función utiliza el cliente para conectarse a un socket servidor TCP?:","respuestas":["Socket","Accept","ExportSocket"],"solucion":"Socket"},
{"id":40,"enunciado":"¿Qué tipo de socket son NO orientados a la conexión?:","respuestas":["SSH","Datagrama","Stream"],"solucion":"Datagrama"},
{"id":41,"enunciado":"El problema del cifrado de clave privada o simétrica:","respuestas":["Es conocer la clave privada","Es el hecho de que es necesario el envío del mensaje mediante un canal seguro","Es el hecho de que es necesario el envío del mensaje mediante un canal público abierto"],"solucion":"Es el hecho de que es necesario el envío del mensaje mediante un canal seguro"},
{"id":42,"enunciado":"El protocolo de la capa de transporte orientado a la conexión es:","respuestas":["FTP","UDP","TCP"],"solucion":"TCP"},
{"id":43,"enunciado":"¿Qué tipo de socket son no orientados a la conexión?:","respuestas":["Datagrama y Stream","Stream y UDP","UDP y Datagrama"],"solucion":"UDP y Datagrama"},
{"id":44,"enunciado":"Mediante las clases orientadas a la conexión:","respuestas":["Se pueden realizar aplicaciones concurrentes","Podremos establecer una arquitectura cliente/servidor, una de las implementaciones más usadas hoy en el desarrollo de software.","Podemos incluir emisión de vídeo en nuestra aplicación"],"solucion":"Podremos establecer una arquitectura cliente/servidor, una de las implementaciones más usadas hoy en el desarrollo de software."},
{"id":45,"enunciado":"¿Qué función permite aceptar la petición de conexión de un cliente?:","respuestas":["Accept","ServerSocket","Bind"],"solucion":"Accept"},
{"id":46,"enunciado":"El protocolo que cifra los mensajes intercambiados entre emisor y receptor a través de un algoritmo de cifrado simétrico y la clave de sesión mediante un algoritmo de cifrado asimétrico es:","respuestas":["El protocolo SEC-1","El protocolo SSL","El protocolo FTP"],"solucion":"El protocolo SSL"},
{"id":47,"enunciado":"El inconveniente más importante de la criptografía de clave asimétrica:","respuestas":["Consiste en la supresión de la necesidad del envío de la clave, siendo por lo tanto un sistema más seguro","Es la lentitud de la operación","Es la necesidad de distribuir la clave que se emplea para el cifrado por lo que, si alguien consigue hacerse tanto con el mensaje como con la clave utilizada, podrá descifrar el mensaje"],"solucion":"Es la lentitud de la operación"},
{"id":48,"enunciado":"Un algoritmo HASH:","respuestas":["Es un método que permite generar un número que representa de manera única a un documento o conjunto de datos","Es un protocolo utilizado para realizar conexiones seguras en Internet","Es un protocolo que cifra los mensajes intercambiados entre emisor y receptor a través de un algoritmo de cifrado simétrico y la clave de sesión mediante un algoritmo de cifrado asimétrico"],"solucion":"Es un método que permite generar un número que representa de manera única a un documento o conjunto de datos"},
{"id":49,"enunciado":"Telnet:","respuestas":["Es un servicio que ofrece la dirección IP de un sitio web o nombre de dominio para que un host pueda conectarse a éste.","Es un servicio que permite descargar y subir archivos entre un cliente y un servidor","Es un protocolo que se utiliza para transferir información entre clientes web y servidores web"],"solucion":"Es un servicio que ofrece la dirección IP de un sitio web o nombre de dominio para que un host pueda conectarse a éste."},
{"id":50,"enunciado":"En la capa de transporte de TCP se encuentran los protocolos:","respuestas":["ATP y PPP","TCP y UDP","FTP y SMTP"],"solucion":"TCP y UDP"},
{"id":51,"enunciado":"La clase java.net.Socket:","respuestas":["Es un protocolo que se utiliza para transferir información entre clientes web y servidores web","Representa a un servidor en la red","Representa un socket"],"solucion":"Representa un socket"},
{"id":52,"enunciado":"¿En el modelo cliente/servidor, dónde se ubica la interfaz gráfica del sistema?:","respuestas":["Cliente","Servidor","Tanto en el cliente como en el servidor"],"solucion":"Cliente"},
{"id":53,"enunciado":"Los servicios de red que incluyen las aplicaciones de red necesarias para almacenar y recuperar datos de archivos:","respuestas":["Son los servicios de archivo","Son los servicios de mensajería","Son los servicios públicos"],"solucion":"Son los servicios de archivo"},
{"id":54,"enunciado":"FTP:","respuestas":["Es un servicio que ofrece la dirección IP de un sitio web o nombre de dominio para que un host pueda conectarse a éste.","Es un protocolo que se utiliza para transferir información entre clientes web y servidores web","Es un servicio que permite descargar y subir archivos entre un cliente y un servidor"],"solucion":"Es un servicio que permite descargar y subir archivos entre un cliente y un servidor"},
{"id":55,"enunciado":"Gracias a la criptografía:","respuestas":["Conseguimos identificar al emisor, receptor del mensaje, y negar la actualidad del mensaje o el acceso.","Conseguimos preservar la integridad de la web, autenticar al emisor, receptor del mensaje, y confirmar la actualidad del mensaje o el acceso.","Conseguimos preservar la desintegración de la web, identificar al emisor, receptor del mensaje, y confirmar la actualidad del mensaje o el acceso."],"solucion":"Conseguimos preservar la integridad de la web, autenticar al emisor, receptor del mensaje, y confirmar la actualidad del mensaje o el acceso."},
{"id":56,"enunciado":"En un emisor UDP se utiliza la función:","respuestas":["DatagramSocket","DatagramPacket","DataInputStream"],"solucion":"DatagramSocket"},
{"id":57,"enunciado":"¿Cuál de los siguientes es un algoritmo HASH?:","respuestas":["ZHA-1","SHA-1","Telnet"],"solucion":"SHA-1"},
{"id":58,"enunciado":"¿Qué es SOAP (Simple Object Access Protocol)?:","respuestas":["Un protocolo para definir el formato de intercambio de mensajes usado en servicios web","Una capa del modelo de comunicaciones OSI (modelo de interconexión de sistemas abiertos)","Un mecanismo para establecer el diseño de la junta de la trócola"],"solucion":"Un protocolo para definir el formato de intercambio de mensajes usado en servicios web"},
{"id":59,"enunciado":"¿Qué servidor permite asociar un nombre de equipo a su dirección IP?:","respuestas":["Samba","HTTP","DNS"],"solucion":"DNS"},
{"id":60,"enunciado":"El servicio de transferencia de ficheros permite gestionar la transferencia de ficheros entre dos lugares situados en diferentes dispositivos, y se ejecuta sobre:","respuestas":["UDP","TCP","HTTP"],"solucion":"TCP"},
{"id":61,"enunciado":"Un sistema de control de acceso basado en roles también conocido como RBAC :","respuestas":["Consiste en una función de seguridad que permite controlar el acceso de usuarios a determinadas tareas normalmente restringidas","Ewstablece que cualquier usuario pueda acceder a la información","Es un método que permite generar un número que representa de manera única a un documento o conjunto de datos"],"solucion":"Consiste en una función de seguridad que permite controlar el acceso de usuarios a determinadas tareas normalmente restringidas"},
{"id":62,"enunciado":"HTTP:","respuestas":["Es un servicio que permite descargar y subir archivos entre un cliente y un servidor","Es un protocolo que se utiliza para transferir información entre clientes web y servidores web","Es un servicio que ofrece la dirección IP de un sitio web o nombre de dominio para que un host pueda conectarse a éste."],"solucion":"Es un protocolo que se utiliza para transferir información entre clientes web y servidores web"},
{"id":63,"enunciado":"Indica la propiedad que no tiene el protocolo TCP:","respuestas":["Corrección de errores","Comunicaciones multicast","Reensamblado de paquetes"],"solucion":"Comunicaciones multicast"},
{"id":64,"enunciado":"Indique cuál es un algoritmo de tipo simétrico:","respuestas":["RSA","XLS","DES"],"solucion":"DES"},
{"id":65,"enunciado":"Indica qué protocolo no pertenece a la capa de aplicación:","respuestas":["HTTP","ARP","FTP"],"solucion":"ARP"},
{"id":66,"enunciado":"La acción de cifrar:","respuestas":["Permite que los mensajes que se transmiten no puedan ser conocidos por terceras personas","Se utiliza para demostrar que somos nosotros y que el emisor es quien dice ser","Utiliza un sistema de clave asimétrica en el que se cuentan con dos claves, una privada y otra pública"],"solucion":"Permite que los mensajes que se transmiten no puedan ser conocidos por terceras personas"},
{"id":67,"enunciado":"¿Qué protocolo utilizarías para una aplicación que realiza videoconferencia?:","respuestas":["UDP","TCP","Es indiferente"],"solucion":"UDP"},
{"id":68,"enunciado":"Los servicios que ayudan a hacer más eficiente el uso de hardware de almacenamiento:","respuestas":["Son los servicios de mensajería","Son los servicios públicos","Son los servicios de archivo"],"solucion":"Son los servicios de archivo"},
{"id":69,"enunciado":"La encriptación de la información consiste en:","respuestas":["Codificar ésta de manera que si es interceptada por personas no autorizadas no sean capaces de descifrar y tener acceso a la información","Codificar ésta de manera que si es interceptada por personas autorizadas no sean capaces de descifrar y tener acceso a la información","Codificar ésta de manera que se facililte la intercepción por personas no autorizadas para que sean capaces de descifrar y tener acceso a la información"],"solucion":"Codificar ésta de manera que si es interceptada por personas no autorizadas no sean capaces de descifrar y tener acceso a la información"},
{"id":70,"enunciado":"SMTP y FTP son protocolos de la capa de:","respuestas":["Internet","Acceso a la red","Aplicación"],"solucion":"Aplicación"},
{"id":71,"enunciado":"¿Dónde se puede aplicar la criptografía?:","respuestas":["Solo en la identificación y autentificación","En la seguridad de las comunicaciones, y en la identificación y autentificación","Solo en la seguridad de las comunicaciones"],"solucion":"En la seguridad de las comunicaciones, y en la identificación y autentificación"},
{"id":72,"enunciado":"UDP:","respuestas":["Es más sencillo que TCP, porque únicamente comprueba la coherencia de los datos recibidos.","Es más complejo que TCP, porque se garantiza que todos los datos enviados desde el origen llegan al destino íntegramente y en el mismo orden en que han salido del emisor","Es más complejo que TCP, porque comprueba la coherencia de los datos recibidos."],"solucion":"Es más sencillo que TCP, porque únicamente comprueba la coherencia de los datos recibidos."},
{"id":73,"enunciado":"Indica la característica que no pertenece a los sockets UDP:","respuestas":["Establece una conexión entre un cliente y un servidor","Permiten enviar y recibir paquetes","En cada paquete va la dirección y puerto destino"],"solucion":"Establece una conexión entre un cliente y un servidor"},
{"id":74,"enunciado":"La encriptación…:","respuestas":["Es un sistema de control de acceso basado en roles también conocido como RBAC por sus siglas en ingles consiste en una función de seguridad que permite controlar el acceso de usuarios a determinadas tareas normalmente restringidas)","Consiste en codificar ésta de manera que si es interceptada por personas no autorizadas no sean capaces de descifrar y tener acceso a la información","Consiste en protocolos que utilizan algoritmos o métodos criptográficos con el objetivo de conseguir algún objetivo en cuestión de seguridad"],"solucion":"Consiste en codificar ésta de manera que si es interceptada por personas no autorizadas no sean capaces de descifrar y tener acceso a la información"},
{"id":75,"enunciado":"Los servicios que incluyen las aplicaciones necesarias para ejecutar software para clientes de red:","respuestas":["Son los servicios públicos","Son los servicios de aplicación","Son los servicios de mensajería"],"solucion":"Son los servicios de aplicación"},
{"id":76,"enunciado":"En la capa de aplicación sobresalen por encima de los demás los servicios:","respuestas":["HTTP, POP3 y ROCK3","FTP, correo y web","Públicos (PPP), privados (PRP) y semipúblicos(SMTP)"],"solucion":"FTP, correo y web"},
{"id":77,"enunciado":"Indica la librería que permite trabajar con sockets en Java:","respuestas":["java.sockets.*","java.networking.*","java.net.*"],"solucion":"java.net.*"},
{"id":78,"enunciado":"SSL:","respuestas":["Es un método que permite generar un número que representa de manera única a un documento o conjunto de datos","Es un protocolo utilizado para realizar conexiones seguras en Internet","Se utiliza un sistema de clave simétrica en el que el receptor desconoce la clave utilizada para el cifrado."],"solucion":"Es un protocolo utilizado para realizar conexiones seguras en Internet"},
{"id":79,"enunciado":"¿Cuál de los siguientes protocolos de red corresponde a la capa de aplicación?:","respuestas":["SMTP","TCP","UDP"],"solucion":"SMTP"},
{"id":80,"enunciado":"El servicio WWW o web:","respuestas":["Permite gestionar la transferencia de ficheros entre dos lugares situados en diferentes dispositivos","Está basado en Internet Explorer","Normalmente se encuentra asociado al puerto 80"],"solucion":"Normalmente se encuentra asociado al puerto 80"},
{"id":81,"enunciado":"¿Qué puerto se utiliza para el servicio web?:","respuestas":["80","21","8080"],"solucion":"80"}]