[{"id":0,"enunciado":"El protocolo TCP:","respuestas":["Es un protocolo de comunicaciones con conexión y no confiable","Es un protocolo de comunicaciones orientado a la conexión","Es un protocolo de comunicaciones sin conexión y no confiable"],"solucion":"Es un protocolo de comunicaciones orientado a la conexión"},
{"id":1,"enunciado":"¿Qué dirección IP utilizaremos si queremos enviar el mensaje al ordenador local?:","respuestas":["127.0.0.1","127.1.1.1","127.1.0.0"],"solucion":"127.0.0.1"},
{"id":2,"enunciado":"Indica el paso que no realiza un emisor UDP:","respuestas":["Publicar puerto","Envío y recepción de datos","Cerrar socket"],"solucion":"Publicar puerto"},
{"id":3,"enunciado":"¿Qué protocolo utilizarías para una aplicación que envía un fichero de texto?:","respuestas":["UDP","SSH","TCP"],"solucion":"TCP"},
{"id":4,"enunciado":"¿Cuál de los siguientes es un tipo de socket basado en protocolo TCP y orientado a la conexión?:","respuestas":["SSH","Datagrama","Stream"],"solucion":"Stream"},
{"id":5,"enunciado":"La capa de acceso a la red:","respuestas":["Se encarga de ofrecer la capacidad de acceder a cualquier red física","Se encarga de permitir que los nodos incluyan paquetes en cualquier red y viajen de forma independiente a su destino.","Contiene los protocolos de más alto nivel como son SMTP, FTP, etc."],"solucion":"Se encarga de ofrecer la capacidad de acceder a cualquier red física"},
{"id":6,"enunciado":"En un receptor UDP se utiliza la función:","respuestas":["DatagramSocket","DataInputStream","DatagramPacket"],"solucion":"DatagramPacket"},
{"id":7,"enunciado":"¿En qué nivel del modelo OSI se encuentra el protocolo TCP?:","respuestas":["Sesión","Transporte","Red"],"solucion":"Transporte"},
{"id":8,"enunciado":"Indica la capa que se encarga de enrutar un paquete por la red para que llegue a su destino:","respuestas":["Aplicación","Transporte","Red"],"solucion":"Red"},
{"id":9,"enunciado":"¿Qué función permite al servidor publicar un puerto?:","respuestas":["Accept","ServerSocket","ExportSocket"],"solucion":"ServerSocket"},
{"id":10,"enunciado":"¿Qué es FTP?:","respuestas":["Es un protocolo de red utilizado para el intercambio de mensajes de correo electrónico entre computadoras u otros dispositivos","Es generalmente un conjunto de herramientas de desarrollo de software que le permite al programador crear aplicaciones para un sistema concreto","Es un protocolo de red para la transferencia de archivos entre sistemas conectados a una red TCP (Transmission Control Protocol), basado en la arquitectura cliente-servidor"],"solucion":"Es un protocolo de red para la transferencia de archivos entre sistemas conectados a una red TCP (Transmission Control Protocol), basado en la arquitectura cliente-servidor"},
{"id":11,"enunciado":"¿Qué operaciones hay que realizar para optimizar la utilización de sockets en una aplicación cliente/servidor?:","respuestas":["Solo asegurar el sistema","Solo monitorizar los tiempos de respuesta","Monitorizar los tiempos de respuesta, asegurar el sistema y atender múltiples peticiones"],"solucion":"Monitorizar los tiempos de respuesta, asegurar el sistema y atender múltiples peticiones"},
{"id":12,"enunciado":"Un puerto nos permite:","respuestas":["Identificar de manera única una aplicación","Identificar de manera única un equipo en la red","Identificar una aplicación a la que van dirigidos los datos dentro de un equipo"],"solucion":"Identificar una aplicación a la que van dirigidos los datos dentro de un equipo"},
{"id":13,"enunciado":"El protocolo TCP :","respuestas":["Tiene 7 capas (física, enlace, red, transporte, sesión, presentación y aplicación)","Tiene 2 capas (TCP e IP)","Tiene 4 capas (acceso a red, Internet, transporte y aplicación)"],"solucion":"Tiene 4 capas (acceso a red, Internet, transporte y aplicación)"},
{"id":14,"enunciado":"El acierto de Internet ha sido:","respuestas":["Ha sido la nula estandarización de un conjunto de servicios que podríamos denominar “básicos”, que son capaces de soportar nuevos servicios de más bajo nivel, garantizando así la interoperabilidad de todos ellos, necesitando nuevas instalaciones e instalaciones de nuevo software en los clientes que tenga que utilizarlos.","Ha sido el uso de navegadores como Internet Explorer","Ha sido la estandarización de un conjunto de servicios que podríamos denominar “básicos”, que son capaces de soportar nuevos servicios de más alto nivel, garantizando así la interoperabilidad de todos ellos, sin necesidad de nuevas instalaciones ni cambios de software en ninguno de los clientes que tenga que utilizarlos."],"solucion":"Ha sido la estandarización de un conjunto de servicios que podríamos denominar “básicos”, que son capaces de soportar nuevos servicios de más alto nivel, garantizando así la interoperabilidad de todos ellos, sin necesidad de nuevas instalaciones ni cambios de software en ninguno de los clientes que tenga que utilizarlos."},
{"id":15,"enunciado":"POP3 y SMTP:","respuestas":["Son protocolos utilizados para enviar mensajes de email de clientes a servidores a través de Internet","Son protocolos que se utilizan para transferir información entre clientes web y servidores web","Son servicios orientados a distribuir archivos de música"],"solucion":"Son protocolos utilizados para enviar mensajes de email de clientes a servidores a través de Internet"},
{"id":16,"enunciado":"El protocolo FTP:","respuestas":["Contempla algunos aspectos de seguridad basados en SSL","Es uno de los más seguros","Tiene importantes deficiencias de seguridad"],"solucion":"Tiene importantes deficiencias de seguridad"},
{"id":17,"enunciado":"¿Qué protocolo es utilizado para transferir archivos entre sistemas:","respuestas":["TELNET","HTTP","FTP"],"solucion":"FTP"},
{"id":18,"enunciado":"Cuando hablamos de servicios de correo electrónico:","respuestas":["Hablamos de sistemas operativos basados en el protocolo OSI","Nos referimos a los servicios de gestión de los mensajes transmitidos por la red","Básicamente nos referimos a dos servicios diferentes que colaboran para conseguir transmitir un mensaje digital desde el dispositivo del autor (remitente) al dispositivo del destinatario."],"solucion":"Básicamente nos referimos a dos servicios diferentes que colaboran para conseguir transmitir un mensaje digital desde el dispositivo del autor (remitente) al dispositivo del destinatario."},
{"id":19,"enunciado":"El éxito de la red global:","respuestas":["Ha sido el desarrollo de una conectividad barata y eficiente.","Ha sido la falta de definición de protocolos para el intercambio de información","Ha sido el desarrollo de una conectividad a unos precios bastante elevados"],"solucion":"Ha sido el desarrollo de una conectividad barata y eficiente."},
{"id":20,"enunciado":"Los protocolos criptográficos:","respuestas":["Son protocolos que utilizan algoritmos o métodos gráficos con el objetivo de conseguir algún objetivo en cuestión de usabilidad","No hay quién los entienda","Son protocolos que utilizan algoritmos o métodos criptográficos con el objetivo de conseguir algún objetivo en cuestión de seguridad"],"solucion":"Son protocolos que utilizan algoritmos o métodos criptográficos con el objetivo de conseguir algún objetivo en cuestión de seguridad"},
{"id":21,"enunciado":"¿Cuál es el beneficio más importante de la criptografía de clave simétrica?:","respuestas":["Es su velocidad lo cual hace que este tipo de algoritmos sean los más apropiados para el cifrado de grandes cantidades de datos","Es la necesidad de distribuir la clave que se emplea para el cifrado por lo que, si alguien consigue hacerse tanto con el mensaje como con la clave utilizada, podrá descifrar el mensaje","Es la supresión de la necesidad del envío de la clave, siendo por lo tanto un sistema más seguro"],"solucion":"Es su velocidad lo cual hace que este tipo de algoritmos sean los más apropiados para el cifrado de grandes cantidades de datos"},
{"id":22,"enunciado":"La auditoría consiste en :","respuestas":["Comprobar la identidad del usuario que accede a la aplicación. Este proceso se realiza en dos pasos.","Conservar un historial de la aplicación donde se almacene quien la ha realizado, cuando, que permisos tienen los usuarios, etc.","La presentación de toda la información que nos requieran para comprobar que el cifrado se realiza de forma correcta"],"solucion":"Conservar un historial de la aplicación donde se almacene quien la ha realizado, cuando, que permisos tienen los usuarios, etc."},
{"id":23,"enunciado":"¿Qué tipo de criptografía utiliza la misma clave privada tanto para la encriptación como para la desencriptación?:","respuestas":["Asimétrico","Simétrico","Paralelo"],"solucion":"Simétrico"},
{"id":24,"enunciado":"PGP:","respuestas":["Es un protocolo que cifra el contenido del mensaje a intercambiar entre emisor y receptor. En este caso utiliza algoritmos de clave simétrica y asimétrica. Garantiza la integridad de la información, la confidencialidad, la autenticación y no repudio.","Es un protocolo utilizado para asegurar las transacciones de Internet en las que se necesita tarjeta de crédito.","Se trata de un conjunto de protocolos que permiten asegurar las comunicaciones sobre el protocolo IP autenticando y / o cifrando los paquetes IP"],"solucion":"Es un protocolo que cifra el contenido del mensaje a intercambiar entre emisor y receptor. En este caso utiliza algoritmos de clave simétrica y asimétrica. Garantiza la integridad de la información, la confidencialidad, la autenticación y no repudio."},
{"id":25,"enunciado":"Los principales métodos de encriptación son:","respuestas":["Criptografía de clave osimétrica y criptografía de clave perimétrica","Criptografía de clave endométrica y criptografía de clave métrica","Criptografía de clave simétrica y criptografía de clave asimétrica"],"solucion":"Criptografía de clave simétrica y criptografía de clave asimétrica"},
{"id":26,"enunciado":"Para firmar :","respuestas":["Se utiliza un sistema de clave simétrica en el que el receptor desconoce la clave utilizada para el cifrado.","Se utiliza un sistema de clave asimétrica en el que se cuentan con dos claves, una privada y otra pública.","Los mensajes que se transmiten no puedan ser conocidos por otras personas."],"solucion":"Se utiliza un sistema de clave asimétrica en el que se cuentan con dos claves, una privada y otra pública."},
{"id":27,"enunciado":"La criptografía:","respuestas":["Es la técnica que permite generar mensajes o hacerlos legibles","Está relacionada con la antropología","Es la técnica que permite cifrar mensajes o hacerlos ininteligibles"],"solucion":"Es la técnica que permite cifrar mensajes o hacerlos ininteligibles"},
{"id":28,"enunciado":"Indique cuál es un algoritmo de tipo asimétrico:","respuestas":["DES","XLS","RSA"],"solucion":"RSA"},
{"id":29,"enunciado":"El protocolo utilizado para asegurar las transacciones de Internet en las que se necesita tarjeta de crédito es:","respuestas":["POINT","SSL","SET"],"solucion":"SET"}]